//To find repeated regex run [[مدیاویکی:Gadget-Extra-Editbuttons-RegexTest.js]] at console 
//Check regex parameters at excel
var persianToolsDictionary = (function () {
	'use strict';

	var adjective = 'اخمو|ارزان|ارغه|الکن|الکی|انبوه|آبدار|(نا)?آرام|آرغنده|(نا)?آشکار|(نا)?آماده|آهسته|(بی\u200c|با)انضباط|باریک|بد|بدحساب|بددل|بدریخت' +
		'|بر|براق|برخوردار|برومند|بزدل|بلند|بی‌آلایش|بی دست و پا|بیچاره|بیدار|بیمار|پخ|پخش|پخمه|پرت|پرنور|پست|پشمالو|پلید|پوچ|(سر|نا)?پوشیده|پوک' +
		'|پیر|پیروز|تار|تپل|ترد|ترسو|تفت|تلخ|تنبل|تندرو|تنک|تنگ|تنها|تهی|تیره|جلو|چابک|چاپلوس|چالاک|چپ|چرند|چسبان|چفته|چیره|خام|خانم|خراب' +
		'|خرم|خسته|خشک|(نا)?خفته|خفن|خل|خنگ|(نا)?خوانا|خوب|خوشکل|خوش‌گوار|خیراندیش|دراز|درخور|درستکار|دلباخته|دلیر|دوست|دون|رحیم|رسمی|روانی|روشن' +
		'|ریغو|زبر|زبردست|زبل|زشت|زیبا|زیرک|ژرف|ژنده|ساده|(نا)?سالم|ساکت|سبک|سخاوتمند|سر|سرکش|سفت|سوسول|شایسته|شکیبا|شل|شور|طولانی|عالم|فراوان|فرز' +
		'|فنی|قرتی|قشنگ|قلنبه|قهرمان|کارکن|کال|کبود|کج|کچل|کر|کلان|کلفت|کم|کند|کنس|کوتاه|کوتوله|کوچک|کوچولو|کودن|گدا|گران|گرسنه|گشاد' +
		'|گنگ|گود|گیج|لاغر|لبریز|لخت|لغزنده|له|مات|مچاله|مچل|(نا)?مرد|مردمی|مردنی|مست|مشکوک|مفید|ناپدید|ناپسند|ناتوان|ناجنس|ناجور|ناچیز|ناخوش' +
		'|نادان|(نا)?درست|نازک|ناسپاس|نافرمان|ناگوار|نامرد|نرم|نیازمند|نیرومند|هشیار|هیز|واژگون|ول|ولرم|ولنگار|یکپارچه|یکدست|یکرنگ|(نا)?پیدا' +
		'|گناهکار|ریز|دانا|کثیف|آقا|(با|بی\u200c)سواد|عاشق|(با|بی\u200c)محبت|صاف|زمخت|فریبنده|پیچیده|سخت|دشوار|تمیز|(نا)?پاکیزه|بزرگ|پهن|پخته|بی‌مورد' +
		'|بی‌نیاز|(بی\u200c|با|)تجربه';

	var personNames = 'الله|محمد|علی|حسن|حسین|جواد|باقر|مهدی|تقی|نقی|نازی|نجم|' +
		'اکرم|کاظم|عباس|منصور|خسرو|محمود|شمس|ملک|شوکت|' +
		'نصر|همت|جهان|جلال|موسی|ابراهیم|جعفر|احمد|قاسم|کمال|هاشم|' +
		'شفیع|صمد|شیخ|اسماعیل|ربیع|سلیمان|رستم|شاهرخ|فرخ|شریف|نعمت|' +
		'امیر|خلیل|جلیل|مجید|اسد|شوکت|رضا|عجل|ید|عبد|سهیل|معصوم|عظیم' +
		'اکبر|اصغر|بهمن|قلی|پری|صفی';

	var wordsWithA = 'ورامدن|هرزاب|هراینه|هجوامیز|نوش‌اذر|نواوری|نواموز|نهراب|میراخور|میراب|می‌اید|می‌اورند' +
		'|ماخذ|مابی|لس‌انجلس|گل‌اذین|گزنداور|گرداوری|گرداوردن|گرداورد|گردامدن|کنداور|کفرامیز|فرودامدن|عطراگین|طنزامیز' +
		'|شیرابه|شهرا[یئ]ین|شهراشوب|سوداور|سراوردن|سرامدن|سرامد|سراشپز|سحرامیز|زیرابی|زوراور|زهرالود|زهراگین|زردالو|دوداهنگ|دواتشه' +
		'|دژاهنگ|دژالود|درداور|دردالود|درایند|دراید|دراویختن|دراوری|دراورنده|دراورند|دراوردن|درامده|درامدن|درامد|خیزاب|خشم‌الود' +
		'|چندش‌اور|جگراور|تیراهن|تهورامیز|تنفراور|تنداب|پسندامدن|پرنداور|پردرامد|پراشوب|پراب|بی‌اب|بوا|بنداوردن' +
		'|بنداور|سرامدن|برایند|براورده|براوردن|براورد|برامده|برامدن|برامدگی|برامد|براشفته|براشفتن|براشفتگی|براسودن|بداهنگ' +
		'|بداموزی|بدامدن|بدامد|ائورت|ائسه|ا[یئ]ینه|ا[یئ]ین‌نامه|ا[یئ]ین|ایه‌یاب|ایه|اینه‌دار|اینده|ایندگان|ایفون' +
		'|ایروپلن|ایدین|ایتم|ایت‌الله|ایات|اویشن|اویسا|اویژه|اویزون|اویزه|اویزند|اویزگر|اویزش' +
		'|اویزدار|اویزان|اویز|اویخته|اویختنی|اویختن|اویختگی|اویخت|اویتخه|اووکادو|اونگون|اونگان|اونگ|اوند|اوریل' +
		'|اوریدن|اورنده|اورند|اورنجن|اوردیدن|اورده|اوردنی|اوردن|اوردگه|اوردگاه|اوردجو|اورد' +
		'|اوایش|اوانویس|اوانگارد|اوانتاژ|اواکس|اواشناس|اوازه‌خوان|اوازهای|اوازه|اوازخوان|اواز|اواره|اوارگی|اوارگان' +
		'|اوار|اهو|اهنین|اهنگ‌ساز|اهنگرخانه|اهنگر|اهنگ|اهن‌فروش|اهن‌ربا' +
		'|اهن‌پاره|اهن‌بر|اهن‌الات|اهن|اهک‌سازی|اهک‌پزی|اهک‌پز|اهک|اهسته|اهستگی|اهای|اهان' +
		'|انیون|انوقت|انود|انها|ان‌گه|ان‌گاه|ان‌که|ان‌کس|انکارا|ان‌قدر|انفولانزا|انفلوانزا' +
		'|ان‌طور|ان‌طرف|ان‌سو|انژیوگرافی|انژین|انزیم|ان‌روی|ان‌روز|ان‌رو|اندوسکوپی|ان‌چه|ان‌جا|انتیل|انتیک' +
		'|انتی|انتن|انتریک|انتراکت|انتراسیت|انتالیا|اناهیتا|اناناس|انان|انالیز|انالوگ|انارشیسم|اناتومی|اناتولی' +
		'|انابولیسم|امینه|امیغه|امیغ|امیزه|امیزگار|امیزش|امیز|امیخته|امیختن|امیختگی|امیب|امونیوم|امونیت|امونیاک|امون' +
		'|اموکسی|اموزه|اموزنده|اموزگان|اموزگار|اموزش‌یار|اموزشگاه|اموزشکده|اموزش|اموزانه|اموزاندن|اموز|اموده|امودن|امودریا' +
		'|اموخته|اموختن|اموختگی|اموختار|امله|امریکا|امرزیده|امرزیدن|امرزیدگی|امرزنده|امرزگار|امرزش|امرز|امرانه' +
		'|امدید|امدوشد|امدورفت|امده|امدن|امدگی|امدکردن|امد|امخته|امپلی|امپرسنج|امپر|امبولی|امبولانس|امایه|امایش|امال' +
		'|اماسیده|اماسیدن|اماسانیدن|اماس|امازون|امارگیر|امارگر|امارشناسی|امارشناس|اماده‌کردن|اماده|امادگی|امادگاه' +
		'|اماج‌گاه|اماج|اماتور|الیداد|الیاژهای|الیاژ|الونک|الومینیوم|الومینیم|الوزرد|الوده|الودن|الودگی|الودگر|الود|الوچه' +
		'|الوبخارا|الما|الفرد|الفا|الرژی|التو|الترناتیو|الت|الپ|البومین|البوم|البانی|البالوئی|البالو|الا[یئ]یدن' +
		'|الایشی|الایش|الای|الاسکا|الاخون|الاچیق|الات|الاباما|اگنه|اگنده|اگندن|اگاهی‌نامه|اگاهی‌دادن|اگاهی|اگاهگان' +
		'|اگاهانیدن|اگاهانه|اگاهاندن|اگاه|اکوستیک|اکوردئون|اکواریوم|اکنه|اکنش|اکنده|اکندن|اکله|اکسفورد|اکروبات|اکتئون' +
		'|اکتینیوم|اکانتاسه|اکادمیک|اکادمی|اق‌بانو|اقائی|اقایان|اقامنشانه|اقامنش|اقاسی|اقازاده|اقاجان|اقا' +
		'|افریننده|افرینش|افرین|افریکانس|افریقا|افریده|افریدن|افریدگار|افتومات|افتابه|افتاب‌مهتاب|افتاب‌گیر' +
		'|افتاب‌گردان|افتاب‌زده|افتاب‌زدگی|افتاب‌رو|افتاب‌خورده|افتاب‌پرست|افتاب|افاقی|افاق|افات|اغول|اغوشیدن|اغوش|اغل' +
		'|اغشته|اغشتن|اغشتگی|اغش|اغالش|اغاسی|اغازین|اغازیدن|اغازیان|اغازی|اغازه|اغازگر|اغاز|اغاجی|اغا|اشیل|اشیانی|اشیانه' +
		'|اشیان‌بندی|اشیان|اشور|اشوبیدن|اشوب‌ناک|اشوب‌گرانه|اشوب‌گر|اشوب‌کن|اشوب‌طلب|اشوب‌انگیز|اشوب|اشنایان|اشناوری' +
		'|اشناگر|اشناسازی|اشنا|اشکوخیدن|اشکاره|اشکارگر|اشکارساز|اشکارا|اشکار|اشفته|اشفتن|اشفتگی|اشغالدان|اشتی' +
		'|اشفتگی|اشپزخانه|اشپز|اشامیدنی|اشامیدن|اشامه|اشامنده|اشام|اشاب|اسیمه|اسیمگی|اسیب‌زدن' +
		'|اسیب‌دیده|اسیب|اسیاکردن|اسیاسنگ|اسیازنه|اسیاچرخ|اسیابان|اسیاب|اسیا|اسوده‌خاطر|اسوده‌حال|اسوده|اسودن' +
		'|اسودگی|اسمون|اسمانه|اسمان‌سنجی|اسمان‌خراش|اسمانخانه|اسمان|اسکاریس|اسفالت|استینه|استرکاری' +
		'|استردوز|استانه|اسپیرین|اسپرین|اسائی|اسا[یئ]یدن|اساینده|اسایشگاه|اسایش|اسان‌گیری|اسانسورچی' +
		'|اسانسور|اسان|اژیرهوائی|اژیر|اژیانه|اژنگ|اژند|اژفنداک|اژدار|اژانس|ازیدن|ازیتا|ازوقه|ازمون‌گر|ازمون‌گاه|ازمون|ازموده' +
		'|ازمودن|ازمودگی|ازمندی|ازمند|ازمائی|ازمایه|ازماینده|ازمایشی|ازمایشو|ازمایشگاه|ازمایشات|ازمایش|ازمابنده|ازما|ازگار' +
		'|ازرده|ازردن|ازردگی|ازرد|ازاریدن|ازارنده|ازاررسان|ازاردهنده|ازار|ازادی‌خواه|ازادوار' +
		'|ازاده|ازادمنش|ازادمرد|ازادگی|ازادگان|ازادکامی|ازادانه|ازاد|اریانا|اریان|اریا|ار[و]غ' +
		'|ارواره|ارنولد|ارنگ|ارنج|ارنائوت|ارمینا|ارمین|ارمیس|ارمیده|ارمیدن|ارمیدگی|ارمیچر|ارمه|ارمان‌شهر|ارماگدون|ارگون' +
		'|ارکاد|ارشیو|ارشیتکت|ارشه|ارشام|ارش|ارستن|ارسان|ارژانتین|ارزومندانه|ارزومند|ارزوخواه|ارزو|ارتین|ارتیشو|ارتیست' +
		'|ارتور|ارتمیس|ارتروز|ارا[یئ]یدن|ارایه‌گر|ارایشی|ارایشگر|ارایشگاه|ارایش|ارامیدن|ارامگاه|ارامگان|ارام‌کردن' +
		'|ارامش|ارامانیدن|ارام|اراسته|اراستن|اراستگی|ارارات|اراء|اذین|اذرین|اذرنوش|اذرنگ|اذرگون|اذرشهر|اذرسنجی' +
		'|اذرروز|اذرخش|اذربرزین|اذربایجان|اذر|ادینه|ادیس|ادونیس|ادنیس|ادمی‌گرا|ادمیزاد' +
		'|ادمیرال|ادمیت|ادم‌گرا|ادم‌کش|ادمک|ادم‌فروش|ادم‌ربا|ادم‌خوار|ادرنالین|ادرس|ادامس|اداب|اخوندک|اخوند' +
		'|اخور|اخرین|اخرسالار|اخرزمان|اخرت‌شناسی|اخرت|اخرالدواء|اخرالامر|اخر|اختن|احاد|اچمز|اچارکشی|اچاردار|اچار|اجیل|اجودان' +
		'|اجرنما|اجرکاری|اجرچین|اجرپز|اجان|اثار|اتیه|اتیکا|اتیسا|اتلیه|اتشین|اتش‌ناک|اتش‌گیره|اتش‌گیر' +
		'|اتش‌گون|اتش‌گرفتن|اتش‌گاه|اتشکده|اتش‌کار|اتش‌فشان|اتش‌زنه|اتش‌زدن|اتش‌زا|اتش‌دان|اتش‌خوار|اتش‌خانه|اتش‌پاره|اتش‌بان|اتش‌بازی|اتش‌بار' +
		'|اتش|اتریوم|اتروپین|اتابای|اپولو|اپوستروف|اپاندیسیت|اپاندیس|اپارتمان|اپارتاید|اپارات|ابیار|ابونه|ابونمان' +
		'|ابها|ابنوس|اب‌نمک|اب‌نما|اب‌[ن]شدنی|ابنبات|ابمیوه‌گیر|اب‌میوه|اب‌لیمو|ابله‌کوب|ابله‌رو|ابگینه|ابگیر|ابگونه|ابگون‌ساز' +
		'|اب‌گوشت|اب‌گرمکن|اب‌گردان|اب‌گذر|اب‌گاه|اب‌کش|اب‌کانه|اب‌کامه|اب‌کار|اب‌فشان|ابغوره|ابشی|ابشور|اب‌شنگولی|ابشش|اب‌شدنی' +
		'|ابش‌خور|ابشتگاه|ابشار|ابسوار|ابسه|ابسکون|ابستن|ابسالان|اب‌سال|ابزی‌گاه|ابزی‌دان|ابزی|ابریزگاه|ابریزگان|ابریزش' +
		'|ابریز|ابرومند|ابروریزی|ابرنگ|ابرفت|ابراهه|ابراهک|ابراه|ابدیده|ابدزدک|ابدانک|ابدان|ابداری|ابدارخانه|ابدارچی' +
		'|ابدارباشی|ابدار|اب‌خیز|ابخوری|ابجی|ابجوفروشی|ابجوساز|ابجوساختن|ابجو|ابتین|ابتنی|اب‌پنیر|اگهی' +
		'|اب‌پاش|اب‌بها|اب‌بند|اب‌باز|اب‌انبار|ابان|اباژور|اباده|ابادکردن|ابادسازی|ابادان|اباد|اباء'; // first charcter should be آ
	// removed ان for [[ان بی سی]]
	// match ZWNJ also as a space or optional
	wordsWithA = wordsWithA.replace(/\u200c/g, '[\u200c ]?');

	var presentVerbsWithA = 'ارا|ارام|ارامان|ارای|ازار|ازما|ازمای|اسا|اسای|اشام|اشوب|اغار|اغاز|افرین|اکن|اگن|الای' +
		'|امرز|اموز|اموزان|امیز|اهنج|اور|اویز';

	var pastVerbsWithA = 'اراماند|ارامید|ارمید|ازرد|ازمود|اشامید|اشفت|اشوبید|اغازید|اغشت|افرید|اکند|اگند|الود' +
		'|امد|امرزید|اموخت|اموزاند|امیخت|اهیخت|اورد|اویخت';

	var needsNasb = 'اتفاقا|الزاما|لزوما|یقینا|قطعا|حتما|قاعدتا|طبیعتا|طبعا|قهرا|جدّا|حقیقتا|واقعا|مطمئنا|واضحا|مسلما|تماما|کاملا' +
		'|عینا|اکیدا|مطلقا|دقیقا|مستقیما|اصولا|اصلا|اصالتا|نسبا|نسبتا|تقریبا|حدودا|معمولا|قانونا|شرعا|اخلاقا|خلقا|احتمالا' +
		'|استثنائا|اساسا|کلّا|جزئا|مجموعا|جمعا|اجماعا|شدیدا|نهایتا|اقلا|اکثرا|غالبا|عمدتا|ندرتا|بعضا|گاها|صریحا|صراحتا|عموما' +
		'|اختصاصا|خصوصا|مجملا|اجمالا|اختصارا|مختصرا|مشروحا|ظاهرا|باطنا|عمیقا|ذاتا|فطرتا|جسما|ابتدائا|مقدمتا|بدوا|بعدا|قبلا' +
		'|جدیدا|سابقا|اخیرا|ابدا|عمرا|تلویحا|علنا|حضورا|غیابا|نیابتا|لطفا|اجبارا|اختیارا|عالما|عمدا|عامدا|تعمدا|متعمدا|عادتا' +
		'|مستقلا|احتیاطا|احیانا|غفلتا|سهوا|اشتباها|عاجلا|عجالتا|مرتجلا|ارتجالا|سریعا|فورا|دا[یئ]ما|ضرورتا|نقدا|منحصرا|صرفا|دفعتا' +
		'|کرارا|مکررا|مجددا|مرتبا|مستمرا|متواترا|تدریجا|تصادفا|عملا|فعلا|موقتا|ضمنا|نتیجتا|نوعا|اصطلاحا|جسارتا|بالا ?غیرتا|م[وؤ]کدا' +
		'|ذیلا|شخصا|مشترکا|مفصلا|رسما|ترجیحا|قلبا|ر[اأ]سا|تو[اأ]ما|متناوبا|متوالیا|متقابلا|متعاقبا|متّ?فقا|مثلا|فرضا|ایضا|مضافا' +
		'|مصرّ?ا|ارفاقا|انصافا|جهارا|متدرجا|غانما|احتراما|ناچارا|سفارشا|تلفنا|زبانا|کتبا|شفاها|چهارما|ثانیا|ثالثا' +
		'|رابعا|خامسا|سادسا|سابعا|ثامنا|تاسعا|عاشرا|مخصوصا';//اولا و سوما می‌تواند یک نام خاص باشد.

	var hamzehZam ='امیرالمومنین|مومن|رویا|فواد|موذن|مودب|موخر|موتمن|مواخذه|مولف|موثر|مونث|موکد|موسس(?! خورناتسی)|سوال|موسسه';//for[[ران مودی]]removedمودی
	var hamzehZam = hamzehZam.replace(/و/g, 'وء?');
 
	var hamzehNasb ='تاکید|تالیف|تاسیس|تاسیسات|تامل|تفال|تاهل|تامین|تا[یئ]ید|تادیب|تاثیر|تاثر|تاثیرات|تاثیرگذار|تاجیل'+
		'|تاخر|تاخیر|توام|ماوا|مستاجر|مبدا|منشا|متاسفانه|متاسف|متاثر|مساله|متاهل|خلا|ملا عام|رافت|ماخذ|مایوس|ماخوذ'+
		'|مامور|مامورین|ماموران|ماموریت|مامون|مانوس';//removed راس، تالم

	var hamzehAtEnd ='اجزا|احشا|ارتجا|ارتقا|ازا|استثنا|استغنا|استقرا|استمنا|استهزا|اشبا|اشقیا|اشیا|اطبا|اطفا|اعتلا'+
	   '|اغوا|افترا|اقتضا|امنا|انبیا|انقضا|اولیا|ماورا';//re املا-انشا-اعضا-امضا-انزوا-ابتلا-استعفا-اعلا-اعتنا بدون همزه متداولترند، ابدا می‌تواند با همزه یا نتوین باشد در نتیجه برداشته شد

	var hamzehAtInside = {'سو':'استفاده|تعبیر|تفاهم|برداشت','ما':'الشعیر','ماورا':'الطبیعه|النهر'};

	var alefMaghsooreh = 'یحیا|حتا|خنثا|مبرا|مرتضا|مصطفا|موسا|مجتبا|عیسا|عظما|علارغم';//removed اولا- الا

	var colorsNames = 'زرد|قرمز|آبی|سفید|سیاه|بنفش|سرخ|گلگون|ازرق|ابیض|نارنجی|توسی|کبود|ارغوانی|سورمه‌ای|سپید|مشکی|کرم|قهوه‌ای|سبز|طلا[یئ]ی';

	var persianNumbers = 'یک|دو|سه|چهار|پنج|شش|هفت|هشت|نه|ده|یازده|دوازده|سیزده|چهارده|' +
		'پانزده|شانزده|هفده|هجده|نوزده|بیست|سی|چهل|پنجاه|شصت|هفتاد|هشتاد|نود|صد|هزار';

	var addToAbad = 'گلون|افضل|رقی|خیر|دل|حاجی|سید|مبارک|گنج|نهنگ|چنگ|' +
		'سرخ|جنگل|خرم|خونی|دولت|به|نیاز|حفظ|عیش|نجم|بلاش|شیار|' +
		'فتح|فضل|خدر|ساق|کج|زین|اسلام|بالش|پارس|اسکل|یاخچی|مهندس|قوژد';

	var firstNameComplex = {
		'حمید|احمد|محمود': 'رضا',
		'خدا': 'بنده|داد',
		'امیر': 'علی|حسین|محمد|رضا|مهدی|عباس',
		'محمد': 'حسین|رضا|مهدی|جواد|باقر|کاظم|حسن|علی|امیر|طاها|هادی|وحید|حمید',
		'علی': 'رضا|محمد|اصغر|اکبر|قلی'
	};

	var complexes = {
		'ویکی': 'پدیا|مدیا|انبار|واژه|نبشته|خبر|کتاب|داده|دیتا|سفر|تراول|دانشگاه',
		'ایده': 'آل',
		'سخت|نرم|پای|جنگ|نوشت|بد|ماشین': 'افزار',
		'جنگ': 'افروز',
		'برون|درون|میان': 'شهری',
		'میان': 'وعده',
		'مشگین|کلان': 'شهر',
		'پایه|برنامه': 'ریزی',
		'پیاده': 'روی|نظام',
		'انسان|شیطان|روان|گیاه|زیست|جانور|نماد|زمین|هوا|ریخت|خدا|جامعه|رفتار|فرهنگ|معرفت|زبان|کتاب|ستاره|اختر|شرق|اسلام|ریشه|آسیب|باستان|حق|روش|مکان|ویروس|میکروب|حشره': 'شناس',
		'روان|دام|چشم': 'پزشک',
		'روان': 'شناس',
		'بهره|نتیجه|فاصله|اندازه|مچ|رونق|دست|پا|پاچه|آبمیوه|آتش|آمار|اوج|کشتی|رأی|رای|یار|تصمیم|گوشه|کناره|گروگان|نمونه': 'گیر',
		'بهره': 'مند|کش|دهی',
		'ترانه': 'سرا|سرایی|نویس|پرداز',
		'اوج': 'دهی',
		'این': 'جا|طور',// «این گونه در حال انقراض است»
		'آزاد|بد|نیک|مثبت|مصلحت': 'اندیش',
		'پناه|ستیزه': 'جو|جویی|جویان',
		'هم': 'اندیشی|ارزی|راهی|سانی|رزم|خانه|نشین|سان|بند|مرز|سایه|مسلک|زمان|معنی|گام|اکنون',
		'گرم|نرم|سرد|جمع|خنک|خشک|مرطوب|ضرب|تقسیم|کم|سرگرم|خوشحال|ناراحت|سخت|روان|باز|زیبا|زشت|مصرف|تولید': 'کننده|کنندگی|کنندگان',
		'خود|درون|پیه': 'سوز',
		'دل': 'افروز|آزار|آرا|آزرده|بریده|افسرده|ربا|سوز|خواه|گشا',
		'تفریق|افزایش|کاهش|ویرایش|کوزه|سفال|غارت|چپاول|صنعت|امداد|حساب|افسون|ریخته|ترویج|جهاد|زر|درود|سفید|شیشه|حیله|توطئه': 'گر',
		'آهن': 'ربا',
		'طیف|امکان|اقتصاد|نور|زمان|عمق|گرما|فشار|قطر': 'سنج',
		'فیزیک|شیمی|ریاضی|تاریخ|قلم|کتاب|جغرافی': 'دان',
		'نام|اسم|سیاهه|خود|فیلم‌نامه|فیلمنامه|کتاب|روان|نسخه|ویکی|پاک|چرک|دست|پشت|زیر|پا|داستان|برنامه|تاریخ|رمان|عریضه|قصه|مقاله': 'نویس',
		'فیلم': 'بردار|شناس',
		'بار|تخم|کتاب|خواب': 'گذار',
		//اسم خاص
		'شهر': 'بانو|زاد|ناز|نوش',
		'اسد|اسماء?|اسم|امان|امر|امیر|امین|انصار|انعام|اهل|اولیاء?|اکرم|باب|بدیع|برات|بقیة|بهاء?|جار|جند|حبیب|حجت|حزب|حفظ|حمد|خلق|خلیل|خیر|ذبیح|ذکر|رام|رحمت|رحم|رسول|روح|سیف|شمس|شکر|صدق|صدیق|عبد|عزت|عزیز|عین|فتح|فرج|فضل|قدرت|لطف|لعنت|نصرت|نصر|نظیر|نعمت|نور|هیبت|ولی|کلام|کلیم|ید|یوم': 'الله|اللهی',
		//اسم مرکب
		'مستند|هوا|روان|جریان|کار|مجسمه|ایمن|پیاده|مقاوم|امن|ساده|بهینه|مرتب|شبیه|ویکی|پل|جاده|راه|استاندارد|فیلم|آماده|رها|آگاه|زیبا|یکسان|ذخیره|استاندار|متمایز|جدا|شخصی|انبوه|خصوصی|رده|آشکار|ساعت|ماشین|زمینه|دست|سبب|مدل': 'ساز',
		'احترام|اختلاف|اضطراب|اعجاب|افتخار|بحث|بر|تحسین|ترحم|تعجب|تعصب|تنفر|ت[اأ]ثر|ت[اأ]سف|ت[اأ]مل|جالب|جدل|جنجال|حزن|حیرت|خفت|خوف|خیال|چالش|دل|رعب|رقت|روح|شهوت|شور|شوق|شگفت|طرب|عبرت|غرور|غم|فرح|ملال|مهر|نشاط|نفرت|هراس|هوس|وحشت|ی[اأ]س': 'برانگیز|انگیز',
		'چهره|دور|تاریخ|خبر|روزنامه|روز|لرزه': 'نگار',
		'زود|آرام|آب|کله|آش|بخار': 'پز',
		'زهر': 'آگین',
		'مه|پیمان|یخ|سنگ|بت|صف|قانون|ساختار|هنجار': 'شکن',
		'مه': 'لقا',
		'مک': 'کارتی',
		'خون': 'آشام|خوار|بار|گرم|سرد|بها',
		'شیطان|خدا|بت|خورشید|مهر|آتش|یزدان|ایزد|گاو|خود|آفتاب|یکتا|پول|حق|مال|میهن|نژاد|وطن|یگانه': 'پرست',
		'پا[یئ]ین|بالا|عقب|جلو|کنار|ساده|بزرگ|کوچک|عمیق|رقیق|ضخیم|فهیم|گسترده|مهم|مشکل|آسان': 'تر',
		'برگشت|انحنا|برش|انعطاف|مهمان|امکان|تفکیک|تغییر|آسیب|تأثیر|دل|سازش|مهاجر|بازگشت': 'پذیر|ناپذیر',
		'دانش': 'آموخته|پژوه|آموختگی',
		'بی': 'آلایش|ابهت|احترام|احساس|اختیار|اخلاق|ادب|اراده|ارزش|استعداد|استقامت|اصالت|اعتماد|اعتبار|اقتدار|امان|امنیت|انتها|اهمیت|بها|بو|تدبیر|تربیت|تسلط|تعصب|تقوی|توجه|ثبات|جنبه|حس|دریغ|دست و پا|دین|رنگ|روح|رویه|سابقه|سیم|شرف|شعور|لیاقت|مایه|مبالات|مزد|مزه|مصرف|معرفت|معنی|مقدار|مورد|نتیجه|نزاکت|نهایت|نیاز|وجدان|پایه|پرستیژ|پناه|پول|چاره|چیز|کار|دلیل|خبر|طرف|حجاب|هویت|آزار|گزند|حاشیه|تفاوت|حاصل|نام|فکر|بازگشت|شکل|کران|انگیزه|اندازه|ضرر|زیان|خرد|جوابنویس|ریا|باک|قاعده|حواس|قرار',
		//فعل
		'می': 'دانم',
		'عرضه': 'کننده|کنندگان',
		//صفت مرکب
		'ابرو': 'کمان|قیطان',
		'ابله': 'گونه',
		'ابن': 'الیوم|الوقت|السبیل|عباس',
		'اغراق|خشونت|موفقیت': 'آمیز',
		'اجاق': 'کور|سوز',
		'اجل': 'برگشته',
		'اسفل': 'السافلین',
		'اطلاع': 'رسان|رسانی|دهی',
		'انگشت': 'نما|نشان|پیچ',
		'سپاس|نام': 'گزار',
		'گوشت|گیاه|علف|شیر': 'خوار',
		'آدم': 'برفی|فروش|ربا|خوار',
		'آنتی': 'بادی|ژن|ویروس|بیوتیک|اکسیدان',
		'تری|دی': 'اکسید',
		'آب': 'لمبو|تنی',
		'آب|چشمک': 'بازی',
		'ریش|سنگ|قلم': 'تراش',
		'آزرده': 'جان',
		'آزادی|جمهوری|تمامیت|عدالت|وطن|بنفشه|خود|بد': 'خواه',
		'آسوده': 'خاطر|وجدان',
		'آش': 'دهن|خور',
		'آشفته': 'سامان|دماغ|روز',
		'آکنده': 'گوش|پهلو',
		'آلاخون': 'والاخون',
		'آمد': 'نیامد|شد',
		//'با': 'پرستیژ|ابهت|احساس|اخلاق|ادب|ارزش|استعداد|استقامت|اصالت|اقتدار|اهمیت|تدبیر|تربیت|تسلط|تعصب|تقوی',
		'باب': 'الحوائج',
		//'باقی|ته': 'مانده', bug > باقی مانده بود- ته مانده بود.
		'باد': 'نشسته|گرفته',
		'بار': 'خاطر',
		'بالا|پایین|پائین': 'تنه',
		'برنامه|طرح|بتون': 'ریز',
		'بزرگ': 'سال|مرد',
		'بزن': 'دررو|بهادر',
		'بد|خوش': 'سیرت|اخلاق|تراش|ترکیب|ریخت|ادا|استیل|اندام|بو|بینانه|بینی|پخت|برخورد|یمن|خوراک|خیم|رکاب|حال|مزه|حساب|پوش|قلق|منظر|نام',
		'بد|خوش|آب|خواب|جهان|قطب|قبله|جهت': 'نما',
		'بد': 'انجام|پیله|خوی|عنق|کاره|گمان|گوهر|لگام|مسب|مست|مهر',
		'بن': 'بست',
		'به': 'شمار|سازی|غایت|کارگیری',
		'تماشا': 'گر|چی|کننده',
		'حمله|بهره|پیشه|شعله|طاعت|طالع': 'ور',
		'بین': 'النهرین|الملل|الممالک',
		'پاچه': 'ورمالیده',
		'تکه|پاره|آتش|آهن|جگر|چهار': 'پاره',
		'جهان|خدا|سود|شفا|نیرو|گرما|سرما|آزادی|رهایی': 'بخش',
		'پاک': 'نفس|سرشت|دامن|سیرت|منش|دیده',
		'پالان': 'سا[یئ]یده',
		'پینه|کفش|کلاه|تو|رو|چرخ|پالان': 'دوز',
		'پراگنده|تاریک|شکسته|آشفته|آزرده|آسوده|بد|خوش|خونین|سیاه|نازک': 'دل',
		'پری': 'نژاد|چهر',
		'نیک|پست': 'فطرت',
		'پی': 'گم|گرد|فراخ|سپید|نوشت',
		'پیچ': 'واپیچ|پیچ',
		'سفید|سیاه|قهوه‌ای|قرمز|زرد|سبز|بنفش|گلگون|سرخ|پیروزه|مشک|نیل|مشکین|رنگین': 'فام|پوست',
		'پیش': 'مرگ|کسوت|درآمد|آهنگ|شماره|بینی',//بحران مالی پیش آمد
		'تازه': 'وارد|خط|نفس',
		'سیمان|سفید|گل|چمن|مدد|رو|دست‌اندر|زیان|کهنه|کمک|تازه|پا|سنبل|شیرین|پنهان': 'کار',
		'تام': 'الاختیار',
		'خوش|زشت|ترش|میانه|پیاده': 'رو',
		'ترگل': 'ور گل',
		'تکه': 'تکه',
		'ته': 'استکان|لیوان|مانده|دیگ',
		'تن': 'فروش|آسان|آرا|تن|پرور',
		'تند': 'خو|خوی',
		'تنگ': 'چشم',
		'تی': 'تیش',
		'پا|تن|زیر|سبز|سرخ|قرمز': 'پوش',
		'تیره': 'روز',
		'جامع': 'الشرایط|الاطراف',
		'جان': 'سخت|جانی',
		'یدک|فرو|نسل|آدم|ویروس|نقشه|سر|آب|آچار|زوزه|تیغ|لوله|ماله|بار|خط|شیره': 'کش',
		'کشتی|گرده|دشت|نگه|دید|زمین|جنگل|دروازه|ویکی|شتر|دیده': 'بان',
		'چابک': 'سوار|دست',
		'ناقاره|نقاره|چاپ|درشکه': 'چی',
		'قاره|راه': 'پیما|پیمایی|پیمایان',
		'چرب|آذری|ترک|فارسی': 'زبان',
		'چشمه': 'چشمه',
		'چل': 'کلید|تاج|تکه',
		'ناقاره|چوبک|دف|دمبک|ساز|نی|سنتور|تار|ارگ': 'زن',//رده:نوازندگان گیتار زن اهل
		'چیره': 'دست',
		'پول|فنگ|قالی|ظرف|خشک|لباس': 'شو[ئی]ی',
		'چیز': 'فهم',
		'حرف': 'شنو',
		'حق': 'السکوت|التدریس|الزحمه',
		'حکیم': 'باشی',
		'حرام|حلال|نجیب|اشراف|غنی': 'زاده|زادگان',
		'حیرت|دریا|دل': 'زده',
		'حیرت|نام|مقام|یاد|خواب|درد|شگفت|جمع|الزام|چندش|خفقان': 'آور',
		'درد|سوز': 'ناک',
		'حواس': 'پرت',
		'خاله': 'زنک',
		'خام': 'طمع|طبع',
		'خرده': 'پا|شیشه',
		'خشک|آسیمه': 'سر',
		'خنده': 'رو|خریش',
		'خواجه': 'سرا|تاش',
		'سگ|مرغ|خوک': 'دانی',
		'خونین': 'جگر|چشم|شهر',
		'دایم': 'الخمر',
		'دائم': 'الصوم|الخمر',
		'درشت': 'خو',
		'دست': 'خوش|پاچه|چین|آورد|اندرکاران',
		'دم': 'کلفت',
		'دندان|دوره|شهر|بیابان|کوچه|گردا': 'گرد',
		'دودوزه': 'باز',
		'ذوات': 'الارحام|الاذناب',
		'ذوی': 'القربی|الاوتار|العقول',
		'ذی': 'نفع|صلاحیت|فقار|ربط|قیمت|شعور|علاقه|حیات|فن|روح|عقل|حق',
		'چشم|بار|بر|پس|تیر|رو|زیر|غلط|نارنجک': 'انداز',
		'رای|شتاب': 'دهنده|دهندگان',
		'راست': 'راستکی',
		'رحمت': 'العالمین',
		'رسم': 'الخط',
		'رقیق': 'القلب|الفکر',
		'رنگ': 'وارنگ',
		'اندود': 'کاری',
		'سنگ|ریز|دانه|تک|بزرگ|رنگ': 'دانه',
		'رو[یئ]ین|پاد|نرم|سخت': 'تن',
		'روح': 'افزا',
		'ریش': 'ریش',
		'رئیس': 'الوزراء|الرؤسا|جمهور',
		'تصویب|کار|واژه|اجازه|تکذیب|شب|پایان|اساس|آ[یئ]ین|زندگی|توافق|نظام': 'نامه',
		'زنگی': 'مزاج',
		'زوار': 'دررفته',
		'زیست': 'محیط|بوم',
		'سابق|اخیر|فوق|لازم': 'الذکر',
		'سبک': 'مغز|سنگ|عنان|روح|لقا|سایه|سنگین|دست',
		'سبک|سنگین': 'وزن',
		'سر': 'فراز',
		'سرمایه': 'گذار|دار',
		'سربه': 'مهر',
		'سریع': 'السیر|الانتقال',
		'سست': 'زخم|رگ|ریش|عنصر',
		'سنگ': 'فرش',
		'دو|سه|چهار': 'پایه',
		'سیاه': 'مست|سوخته|چرده',
		'سینه': 'چاک',
		'شب': 'رنگ|پره|اداری|نشین',
		'شبانه': 'روزی',
		'شکسته': 'ناخن|مزاج',
		'شکل': 'گیری|پذیر|دادن',
		'شلم': 'شوربا',
		'شوخ': 'طبع|رو|دیده|چشم',
		'شوم|نیک|بلند|بد|خوش': 'اختر|اقبال',
		'شوی': 'دیده',
		'شیرین': 'عقل|دهن',
		'صد': 'شاخ',
		'قتل|بار': 'عام',
		'صف': 'آوار',
		'ضرب': 'المثل|العجل',
		'ضد': 'اسلام|یهودی|انقلاب|حال|هوایی|زنگ|آفتاب|بارداری|سرمایه‌داری|آب|یخ|اطلاعات|شوره',
		//طبق بندهای	شماره ..
		//'طبق|زمان': 'بند', 
		'طبقه|زمان|درجه|رده|گروه|رتبه|دسته|جمله|تقسیم|بسته|آرماتور|اسکلت|امتیاز|بخش|جدول|جمع|جناح|رنگ|ساز|سایز|سرهم|سطح|شرط|شکم|فاز|فصل|قاب|پارتیشن|چشم|کادر|کمر|گاو|نیم|آب|جیره|خالی|ماست|سیل': 'بند',
		'طوطی|عیال': 'وار',
		'طویل': 'المدت',
		'طبیعت|اسلام|یهودی': 'ستیز|گریز',
		'طی': 'الارض',
		'هنر|عاشق': 'پیشه',
		'عالی': 'نسب|رتبه',
		'عام': 'المنفعه',
		'عدیم': 'النظیر',
		'عقب': 'گرد|نشینی',
		'علی': 'البدل|الحساب|الخصوص|رغم',
		'غلط': 'غلوط',
		'فارغ': 'الاکناف|التحصیل',
		'فراخ': 'رو|شکم|بال|کام|دیده|سخن|آهنگ|دست|آستین|ابرو|روزی',
		'فرخ': 'لقا|دیم|فال|پی',
		'فرمان': 'روا|بر',
		'فرنگی|قدسی': 'مآب',
		'غیر': 'قابل|متعهد|اخلاقی|شرعی|انسانی|اصولی|مجاز|حضوری|دولتی|نظامی|انتفاعی|منتظره|قانونی|معمولی|ممکن|رسمی|فعال|نفتی|منقول|ارادی|جایز|طبیعی|عادی|عمد|لازم|مسئول|عادلانه|خودی|عاقلانه|کافی',
		'وفا|فره|نیاز|جفا|خرد|غیرت|باور|ارزش|نعل|درد|علاقه': 'مند',
		'فرو': 'نهادن|داشت|گذاشت|مایه|بست|پاشی|پاشیده',
		'خارق|فوق': 'العاده',
		'کیلو|سانتی|میلی|دسی|نانو|ولت': 'متر|آمپر|گرم',
		'قاچ': 'قاچ',
		'قایق|کلک|کشتی': 'ران|سوار',
		'قافله': 'سالار',
		'قایم': 'الزاویه',
		'قره': 'قاطی',
		'قریب': 'الوقوع',
		'کاه|قطره|دله|آفتابه': 'دزد',
		'قوی|آتشین': 'پنجه',
		'قیمه': 'قیمه',
		'کاسه': 'یکی|سیاه|لیس',
		'کج': 'نهاد|خلق|کلاه',
		'کوه|صخره|دریا|فضا|صحرا': 'نورد',
		'کلاه': 'گوشه|گذار',
		'کله': 'معلق|خشک|گنده|خر|شق|پوک',
		'زبانه|زمین|ماشین|فرمان|کمان|کنگره|گوشه|دامنه|خانه|پول|مقام|آ[یئ]ینه|عهده|بار|ادامه': 'دار',
		'مصاحبه|تهیه|تعیین|استفاده|کنترل|تسهیل': 'شونده|شوندگان|کننده|کنندگان',
		'کهن': 'سال|دیار',
		'کینه': 'توز|ورز',
		'گران': 'مغز|سایه|قدر|رکاب|سرشت|پایه|قیمت|روح|سنگ|جان|سر|فروش',
		'فضل': 'فروش',
		'گشاده': 'رو|دست',
		'گل': 'چهره|ریزان|ریز|باران|آرا|اندام|برگ',
		'گاه': 'شمار',
		'گلوله': 'باران',
		'لازم': 'الوصول|الاجراء',
		'مشکوک|معلوم|مجهول|فارغ': 'الحال',
		'لت': 'لت|انبان|انبار',
		'لسان': 'الغیب',
		'مالک': 'الرقاب',
		'ماه': 'طلعت',
		'مشغول': 'الذمه',
		'معظم': 'له|القدر',
		'ملی|همجنس|زمینه|آرمان|جهاد|اسلام|بنیاد|چپ|راست|صنعت|طبیعت|برون|درون|شرق|غرب|وجدان|اعتدال|عقل|جمهوری': 'گرا|گرایی',
		'تخمین': 'گر',
		'میرزا': 'قلمدان|قشمشم|بنویس',
		'ناخن': 'خشک',
		'نازک': 'نی|نارنجی|خیال',
		'جهان|نافه': 'گشا',
		'ندید': 'بدید',
		'نظریه|رویا|رؤیا': 'پرداز',
		'نقشه|وزنه|بهره|کلاه': 'بردار',
		'نق': 'نقو',
		'نگون': 'طشت|بخت',
		'نیک': 'روز|انجام|پی|بخت',
		'نیم': 'ته',
		'نخست': 'وزیر',
		'هرکن': 'پرکن',
		'همایون': 'فال|آثار|بخت',
		'همه': 'کاره|جانبه|پرسی',
		'هیچ': 'کاره|یک|کس|کدام|کجا',
		'هیچ|دید|شبان|سحر': 'گاه',
		'ول': 'خرج|معطل',
		'یکه': 'شناس|بزن|سوار|تاز|چین|بند|بنداز|زا',
		'بیماری|مشکل': 'زا',
		'یک': 'هوا|هشتم|وقت|وزن|ور|نیمه|نفره|نفس|لا|کم|کله|کلام',
		'ابجد': 'خوان',
		'ابر': 'آلود|قدرت|ابزار',
		'ابو': 'العجب|الکلام|الهول',
		'اولو': 'الالباب|الامر|العزم',
		'حسب|صاحب|واجب': 'الامر',
		'گل|آذر|ناهم|هم|گندم': 'گون',
		'آزاد': 'مرد|وار',
		'باز': 'خرید|خواست|دید|بین',
		'بر': 'هم|آشفتگی|آشفته|پایی',
		'بلند': 'آوازه|پایه',
		'آتش': 'بس|نشان|سوزی|افروز|افکن|افزار',
		'پا': 'برجا|برهنه|بست|پتی',
		'پایه|بنیان|بمب': 'گذار|گذاری|گذاران',
		//'مادر|خواهر|برادر|فرزند|پدر': 'خوانده', // bug > وی پدر خوانده شد.(پدر صدا زده شد)
		'پر': 'ابهام|ابهت|اتلاف|ادا|ادویه|ازدحام|استرس|استقامت|اشک|برخورد|ترانه|تردد|ترشح|تشبیه|تصادف|تعصب|تقلب|تلاش|تملق|شور|هیاهو|بیننده|بار',
		'کم': 'محل|بضاعت|کم',
		'پر|کم': 'نظیر|کار|تعداد|اشتباه|اشکال|اهمیت|تحرک|تحول|ترافیک|تراکم|تقاضا|تکرار|تنش|تنوع|رو|آب',
		'تنگا': 'تنگ',
		'تیز': 'پا|دست|دندان|هوش|بین',
		'چادر|تخت|زاغه|شهر|ته|آب|کاخ|پایتخت|یکجا|ییلاق|قشلاق': 'نشین',
		'چهار': 'شانه',
		'فلز|تشابه|ویروس|مکان|طلا|کم|عیب|مسافت|فاصله|جهت|موقعیت|غلط|راه|اشتباه|گنج': 'یاب',
		'راه|گاو': 'آهن',
		'دستگیر': 'شدگان',
		'هماهنگ': 'کننده|کنندگان|کردن',
		//'یاد': 'داشت|دهی', به یاد داشت- به یاد دهی افتادم
		'یار': 'کشی',
		'ی[اأ]س': 'آلود',
		'حاضر': 'جواب|یراق',
		'خرد': 'سال',
		'دو': 'برجی|تخمه|سره|قلو|به‌شک',
		'ذو': 'الجلال|العرش|القدر|القوافی|اللسانین|المجد|المکارم|المن|المناقب|المنن|النور|الوجهین|جسدین',
		'رنگا': 'رنگ',
		'رو': 'سفید|سیاه|باز',
		'قهوه|نگار|آبدار|گل|کتاب|رود|زور|نوا|سرد': 'خانه',
		'روز': 'افزون|انه',
		'زود': 'باور',
		'شاد': 'روان|کام|مان|مانه',
		'فرا': 'خور|روی',
		'کد': 'خدا|بانو',
		'لا': 'ابالی|جون|کردار|مذهب|مروت|یتغیر|یتناهی|یزال|یعقل',
		'نا': 'جوانمرد|خودآگاه|نجیب|امید|آزموده|آشنا|آگاه|برابر|تمام'
	};

	//----------------------------------------Wrong dictations-----------------------
	var forReplace = {
	   'آندروید': 'اندروید',
	   'واشنگتن': 'واشینگتن',
	   'واشنگتون': 'واشینگتن',
	   'واشینگتون': 'واشینگتن',
	   'زیمباوه': 'زیمبابوه',
	   'به شخصه': 'بشخصه',
	   'به‌شخصه': 'بشخصه',
	   'به عینه': 'بعینه',
	   'به‌عینه': 'بعینه',
	   'احمدی نژاد': 'احمدی‌نژاد',
	   'جابه جا': 'جابه‌جا',
	   'جا به جا': 'جابه‌جا',
	   'جا به‌جا': 'جابه‌جا',
	   'بیت المقدس': 'بیت‌المقدس',
	   'بی بی سی': 'بی‌بی‌سی',
	   'پی دی اف': 'پی‌دی‌اف',
	   'اس ام اس': 'اس‌ام‌اس',
	   'اف بی آی': 'اف‌بی‌آی',
		'می سی سی پی': 'می‌سی‌سی‌پی',
		//'میسیسیپی': 'می‌سی‌سی‌پی',
		'ویژه‌گی': 'ویژگی',
		'دبیر کل': 'دبیرکل',
		'دایره‌المعارف': 'دایرةالمعارف',
		'دایره المعارف': 'دایرةالمعارف',
		'تأئید': 'تأیید',
		'تائید': 'تأیید',
		'تصویه': 'تصفیه',
		'بقیه‌الله': 'بقیةالله',
		'بقیه الله': 'بقیةالله',
		'بقیة الله': 'بقیةالله',
		'دگمه': 'دکمه',
		'وحله': 'وهله',
		//'هاوی': 'حاوی', ممکن است اسم خاص باشد
		'نقطه‌نظر': 'دیدگاه',
		'ناچاراً': 'به‌ناچار',
		'ناچارا': 'به‌ناچار',
		'منیت': 'منی',
		'منیٔت': 'منی',
		'فرآیند': 'فرایند',
		'فرآیندها': 'فرایندها',
		'کارآیی': 'کارایی',
		'ملاحضه': 'ملاحظه',
		'ملیون': 'میلیون',
		'ملیارد': 'میلیارد',
		'مطمعن': 'مطمئن',
		'مرهمت': 'مرحمت',
		'مرحم': 'مرهم',
		'مونته نگرو': 'مونته‌نگرو',
		'محصوب': 'محسوب',
		'مذبور': 'مزبور',
		'متعصفانه|متاصفانه': 'متأسفانه',
		'متغییر': 'متغیر',
		'لشگر': 'لشکر',
		'لحجه': 'لهجه',
		'گاهاً': 'گاهی',
		'گاها': 'گاهی',
		'کهکیلویه': 'کهگیلویه',
		'قائله': 'غائله',
		'فارق‌التحصیل': 'فارغ‌التحصیل',
		'علاالدین': 'علاءالدین',
		'علم‌شنگه': 'الم‌شنگه',
		'غلطاندن': 'غلتاندن',
		'ظبط': 'ضبط',
		'طنبور': 'تنبور',
		'طپش': 'تپش',
		'ضمینه': 'زمینه',
		'زخامت|ذخامت': 'ضخامت',
		'زخیم|ذخیم': 'ضخیم',
		'صحفه': 'صفحه',
		//'سوماً': 'سوم',
		//'سوما': 'سوم',
		'سفارشاً': 'سفارشی',
		'سفارشا': 'سفارشی',
		'سرلشگر': 'سرلشکر',
		'سپاسگذار': 'سپاسگزار',
		'خبرگذار': 'خبرگزار',
		'ساتع': 'ساطع',
		'زنده‌گی': 'زندگی',
		'زباناً': 'زبانی',
		'زبانا': 'زبانی',
		'رهبریت': 'رهبری',
		'در باره': 'درباره',
		'دوئیت': 'دوگانگی',
		//'دوماً': 'دوم',
		//'دوما': 'دوم',
		'داوطلبین': 'داوطلبان',
		'خوشنود': 'خشنود',
		'خوبیت': 'خوبی',
		'خوانواده': 'خانواده',
		'خواستگاه': 'خاستگاه',
		'خرشید': 'خورشید',
		'خردن': 'خوردن',
		'خانند': 'خوانند',
		'خابیدن': 'خوابیدن',
		'حظور': 'حضور',
		'حظرت': 'حضرت',
		'حدلامکان': 'حتی‌الامکان',
		'حاظر': 'حاضر',
		'چهارماً': 'چهارم',
		'چهارما': 'چهارم',
		'چارشنبه': 'چهارشنبه',
		'جاناً': 'جانی',
		//'جانا': 'جانی', باگ در [[جانا رودین]]
		'توجیح': 'توجیه',
		'توضیع': 'توزیع',
		'تلوزیون': 'تلویزیون',
		'تضاهر': 'تظاهر',
		'ترجیه': 'ترجیح',
		'پنچ': 'پنج',
		'پزشگی': 'پزشکی',
		//'پرفسور': 'پروفسور', //[[Special:Permalink/20573389#professeur]]
		'پاتوغ': 'پاتوق',
		'بی‌مهابا': 'بی‌محابا',
		'بنیانگزار': 'بنیانگذار',
		'بلقور': 'بلغور',
		'بلاخره': 'بالاخره',
		'برخواستن': 'برخاستن',
		'برعلیه': 'علیه',
		'برخواست': 'برخاست',
		'بدیت': 'بدی',
		'باطلاق': 'باتلاق',
		'بازرسین': 'بازرسان',
		'بارگزار': 'بارگذار',
		'باجناق': 'باجناغ',
		'باباقوری': 'باباغوری',
		'آروق': 'آروغ',
		'انظباط': 'انضباط',
		'التفاط': 'التفات',
		'افضل‌تر': 'بهتر',
		'افسنطین': 'افسنتین',
		'اعلم‌تر': 'داناتر',
		'اطو': 'اتو',
		'اطراق': 'اتراق',
		'اطاق': 'اتاق',
		'اصطرلاب': 'اسطرلاب',
		'ارتقاع': 'ارتقا',
		'اختاپوث': 'اختاپوس',
		'ابولفضل': 'ابوالفضل',
		'امپراطور': 'امپراتور',
		//'طوسی': 'توسی', خواجه نصیرالدین طوسی را به تبدیل می کرد
		'آزوقه': 'آذوقه',
		'ذکام': 'زکام',
		'بگیر و ببند': 'بگیر ببند',
		'ساز و کار': 'سازوکار',
		'جر و بحث': 'جربحث',
		'خوار و بار': 'خواربار',
		'احجام': 'حجم‌ها',
		'لازم به ذکر است': 'لازم است ذکر شود',
		'بدلیل':'به دلیل',
		//برپایه http://www.persianacademy.ir/fa/pishvand.aspx
		'آن‌را': 'آن را',
		'این‌را': 'این را',
		'هیات': 'هیئت',
		'هیأت': 'هیئت',
		'رییسه': 'رئیسه',
		'رییس': 'رئیس',
		'رییس‌جمهور': 'رئیس‌جمهور',
		'مساله': 'مسئله',
		'مسأله': 'مسئله',
		'همین جا': 'همین‌جا',
		'همینجا': 'همین‌جا',
		'همینطور': 'همین‌طور',
		'همین طور': 'همین‌طور',
		'همان جا': 'همان‌جا',
		'همانجا': 'همان‌جا',
		'به طور': 'به‌طور',
		'بطور': 'به‌طور',
		'همان طور': 'همان‌طور',
		'همانطور': 'همان‌طور',
		'هیچکدام': 'هیچ‌کدام',
		'هیچ کدام': 'هیچ‌کدام',
		'هیچکس': 'هیچ‌کس',
		'هیچ کس': 'هیچ‌کس',
		'هیچیک': 'هیچ‌یک',
		'هیچ یک': 'هیچ‌یک',
		'هم‌دیگر': 'همدیگر',
		'عبدالهی': 'عبداللهی',
		'آن چه': 'آنچه',
		'آن‌چه': 'آنچه',
		'چنان چه': 'چنانچه',
		'چنانچه': 'چنانچه',
		'چنان که': 'چنان‌که',
		'چنانکه': 'چنان‌که',
		'ئیدروژن': 'هیدروژن',
		//بدل از تنوین
		'بعضن': 'بعضاً',
		'غالبن': 'غالباً',
		'کاملن': 'کاملاً',
		'احتمالن': 'احتمالاً',
		'اصلن': 'اصلاً',
		'اشتباهن': 'اشتباهاً',
		'منشاء': 'منشأ',
		'مبداء': 'مبدأ',
		'موسیقیایی': 'موسیقایی',
		'یوگوسلاوی': 'یوگسلاوی',
		'وب‌گاه': 'وبگاه',
		//وپ:کوته‌نوشت
		//رجوع کنید
	   'ر\\. ?ک\\.?': 'ر.ک.',
		//هجری خورشیدی
		'[هﻫﻩ]\\u200D?\\. ?خ\\.?': 'ه‍.خ',
		'[هﻫﻩ]\\u200D?[\\u200C ]خ': 'ه‍.خ',
		'[هﻫﻩ]\\u200D?\\. ?خ\\.?\\)': 'ه‍.خ)',
		'\\([هﻫﻩ]\\u200D?\\. ?خ\\.?': '(ه‍.خ',
		//هجری قمری
		'[هﻫﻩ]\\u200D?\\. ?ق\\.?': 'ه‍.ق',
		'[هﻫﻩ]\\u200D?[\\u200C ]ق': 'ه‍.ق',
		'[هﻫﻩ]\\u200D?\\. ?ق\\.?\\)': 'ه‍.ق)',
		'\\([هﻫﻩ]\\u200D?\\. ?ق\\.?': '(ه‍.ق',
		//هجری شمسی
		'[هﻫﻩ]\\u200D?\\. ?ش\\.?': 'ه‍.ش',
		'[هﻫﻩ]\\u200D?[\u200C ]ش': 'ه‍.ش',
		'[هﻫﻩ]\\u200D?\\. ?ش\\.?\\)': 'ه‍.ش)',
		'\\([هﻫﻩ]\\u200D?\\. ?ش\\.?': '(ه‍.ش',
		//الی آخر
		'الخ\\.': 'الخ',
		'نتیجهگیری': 'نتیجه‌گیری',
		'مهمتر': 'مهم‌تر',
		'مهمترین': 'مهم‌ترین',
		'پیشبینی': 'پیش‌بینی',
		'اندازهگیری': 'اندازه‌گیری',
		'برنامهریزی': 'برنامه‌ریزی',
		'بزرگترین': 'بزرگ‌ترین',
		'کوچکترین': 'کوچک‌ترین',
		'راهحل': 'راه‌حل',
		'روانشناس': 'روان‌شناس',
		'روانشناسی': 'روان‌شناسی',
		'روانپزشک': 'روان‌پزشک',
		'روانپزشکی': 'روان‌پزشکی',
		'چشمپزشک': 'چشم‌پزشک',
		'چشمپزشکی': 'چشم‌پزشکی'
	};

	function dictationReplace(x, y, extensions, text) {
		return text.replace(
			new RegExp(
				'(^|[^' + persianTools.persianCharacters + '])(\\s|\u200c|_|)(' + x + ')(\\s|_)(' + y + ')(\\s|\u200c|_|)(' +
				extensions + ')($|[^' + persianTools.persianCharacters + '])',
				'g'
			),
			'$1$2$3\u200c$5$6$7$8'
		);
	}

	function dictation(text) {
		var i,
			dictionary = persianToolsDictionary,
			NASB = '\u064b', // ًـ
			ZAMM = '\u064c'; // ُـ
		for (i in complexes) {
			text = dictationReplace(
				i,
				complexes[i],
				'ی|یی|ها|های|هایی|هایم|هایت|هایش|هایمان|هایتان|هایشان|',
				text
			);
		}
		// for last name
		text = dictationReplace(
			personNames,
			'ی|یی|زاده|نیا|گان|فر|نژاد|یان|ی\u200cها|یها',
			'ی|',
			text
		);
		// for 'آباد's
		text = dictationReplace(
			personNames + '|' + addToAbad,
			'آباد',
			'زاده|نیا|پور|گان|فر|نژاد|ی|یان|ها|های|یی|هایی|ی\u200cها|یها|',
			text
		);
		// for first names
		for (i in firstNameComplex) {
			text = text.replace(
				new RegExp(
					'(^|[^' + persianTools.persianCharacters + ']|\\s|_)(' + i + ')(\\s|_)(' +
					firstNameComplex[i] + ')(\\s|_)($|[^' + persianTools.persianCharacters + ']|[^' +
					persianTools.persianCharacters + '])',
					'g'
				),
				'$1$2\u200c$4$5$6'
			);
		}
		// for colors
		text = dictationReplace(
			colorsNames,
			'فام|گون',
			'زاده|نیا|پور|گان|فر|نژاد|ی|یی|ها|های|هایی|ی\u200cها|یها|هایم|هایت|هایش|هایمان|هایتان|هایشان|',
			text
		);
		// for numbers
		text = dictationReplace(
			persianNumbers,
			'گانه|ماهه',
			'زاده|نیا|پور|گان|فر|نژاد|ی|یی|ها|های|هایی|هایم|هایت|هایش|هایمان|هایتان|هایشان|',
			text
		);
		// wrong dictation
		for (i in forReplace) {
			text = text.replace(
				new RegExp(
					'(^|[^' + persianTools.persianCharacters + '])(\\s|\\(|\u200c|_|)(' + i + ')(\\s|\\)|\u200c|_|)($|[^' +
					persianTools.persianCharacters + '])',
					'g'
				),
				'$1$2' + forReplace[i] + '$4$5'
			);
		}

		var preword = "(^|\\s|_|«|»|\\[|\\(|\\<|\\>|\\')(";
		// کلماتی که آ دارند
		text = text.replace(
			new RegExp(preword + wordsWithA + ")(ی|ئی|یی|ٔ|)(?= |«|»|\\.|،|_|\\]|\\s|\\:|\\)|\\<|\\>|؟|\\'|\\!|$)", 'g'),
			function (x) { return x.replace(/ا/i, 'آ'); } // 'i' is just to trick bidi algorithm on code view
		);
		// بن مضارع که آ دارند
		text = text.replace(
			new RegExp("(^|\u200c|\\s|_|«|»|\\[|\\(|\\<|\\>|\\')(" + presentVerbsWithA + ")(م|ی|د|یم|ید|ند)(?= |«|»|\\.|،|_|\\s|\\]|\\:|\\)|\\<|\\>|؟|\\!|\\'|$)", 'g'),
			function (x) { return x.replace(/ا/i, 'آ'); } // 'i' is just to trick bidi algorithm on code view
		);

		// بن ماضی که آ دارند
		text = text.replace(
			new RegExp("(^|\u200c|\\s|_|«|»|\\[|\\(|\\<|\\>|\\')(" + pastVerbsWithA + ")(م|ی|یم|ید|ند|ه|)(?= |«|»|\\.|،|_|\\s|\\]|\\:|\\)|\\<|\\>|؟|\\!|\\'|$)", 'g'),
			function (x) { return x.replace(/ا/i, 'آ'); } // 'i' is just to trick bidi algorithm on code view
		);

		// همزه ضم
		text = text.replace(
			new RegExp(preword + hamzehZam + ")(‌ها|ها|ین|ان|ی|ئی|یی|ٔ|)(?= |«|»|\\.|،|_|\\s|\\]|\\:|\\)|\\<|\\>|؟|\\!|\\'|$)", 'g'),
			function (x) { return x.replace(/وء/, 'ؤ').replace(/و/i, 'ؤ'); } // 'i' is just to trick bidi algorithm on code view
		);
		//همزه نصب
		text = text.replace(
			new RegExp(preword + hamzehNasb + ")(ی|ئی|یی|ٔ|)(?= |«|»|\\.|،|_|\\s|\\]|\\:|\\)|\\<|\\>|؟|\\!|\\'|$)", 'g'),
			function (x) { return x.replace(/ا/i, 'أ'); } // 'i' is just to trick bidi algorithm on code view
		);

		//همزه وسط کلمه
		for (i in hamzehAtInside) {
			text = text.replace(new RegExp(
				preword + i + ')(| )(' + hamzehAtInside[i] + ")(?= |«|»|\\.|،|_|\\s|\\]|\\:|\\)|\\<|\\>|؟|\\!|\\'|$)",
				'g'
			), '$1$2ء$4');
		}

		// در مورد افزودن یا حذف همزهٔ پایانی اجماعی وجود ندارد.
		/* text = text.replace(new RegExp(preword + hamzehAtEnd + ")(?= |«|»|\\.|،|_|\\s|\\]|\\:|\\)|\\<|\\>|؟|\\!|\\'|$)", 'g'),'$1$2ء'); */

		//الف مقصوره
		text = text.replace(
			new RegExp(preword + alefMaghsooreh + ")(?= |«|»|\\.|،|_|\\s|\\]|\\:|\\)|\\<|\\>|؟|\\!|\\'|$)", 'g'),
			function (x) { return x.replace(/ا/i, 'ی'); } // 'i' is just to trick bidi algorithm on code view
		);

		// صفت+تر
		text = text.replace(new RegExp("(^|\\s|_|«|»|\\]|\\[|\\(|\\<|\\>|\\')(" + adjective + ")( |_)تر(?= |«|»|\\.|\\[|\\]|،|_|\\s|\\:|\\)|\\<|\\>|؟|\\!|\\'|$)", 'g'), '$1$2\u200cتر');

		// اسامی رنگ‌ها (به‌عنوان صفت)+تر
		text = text.replace(new RegExp("(^|\\s|_|«|»|\\]|\\[|\\(|\\<|\\>|\\')(" + colorsNames + ")( |_)تر(?= |«|»|\\.|\\[|\\]|،|_|\\s|\\:|\\)|\\<|\\>|؟|\\!|\\'|$)", 'g'), '$1$2\u200cتر');

		text = text.replace(/به دست\u200cآورد/g, 'به دست آورد'); // Solving a bug!
		text = persianTools.normalizeZwnj(text);
		return text.replace(new RegExp("(^|[؛\\s\\n\\.،«»\'\\<\\>؟])(" + needsNasb + ')[' + NASB + ZAMM + ']?([؛؟\\s\\n\\.،«»\'"\\<\\>]|$)', 'g'), function (match) {
			return match
				.replace(new RegExp('ا([\\s\\n\\.،«»؟؛"\'\\>\\<' + ZAMM + '])', 'i'), 'ا' + NASB + '$1')
				.replace(new RegExp(NASB + '["' + NASB + ZAMM + ']'), NASB);
		});
	}

	return {
		'dictation': dictation
	};
}());
if (typeof window !== 'undefined') {
	window.persianToolsDictionary = persianToolsDictionary;
}